
## :x: Apply Failed (koyashiro.live)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789311921)



<pre><code>Error: error validating record content of &#34;@&#34;: AAAA record must be a valid IPv6 address, got: &#34;2001:19f0:7001:0b3b:5400:03ff:fef9:a590\t&#34;

  with cloudflare_record.aaaa_root,
  on dns_records.tf line 10, in resource &#34;cloudflare_record&#34; &#34;aaaa_root&#34;:
  10: resource &#34;cloudflare_record&#34; &#34;aaaa_root&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.a_root: Refreshing state... [id=e1a783275516e1f83ff07f4ca273eeb5]
cloudflare_record.txt_keybase_site_verification: Refreshing state... [id=e6b39af7f2fb61e83054f98a9aba3b4b]
cloudflare_record.txt_spf: Refreshing state... [id=1590a0936e741cef6684a2b7b8c00f8f]
cloudflare_record.txt_dkim: Refreshing state... [id=b31bac6bcce999e718d39fd2b2586d48]
cloudflare_record.txt_dmarc: Refreshing state... [id=650e1f15d10efe470b88eece8d3d1aa1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.aaaa_root will be created
  + resource "cloudflare_record" "aaaa_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "AAAA"
      + value           = (sensitive value)
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
cloudflare_record.aaaa_root: Creating...

Error: error validating record content of "@": AAAA record must be a valid IPv6 address, got: "2001:19f0:7001:0b3b:5400:03ff:fef9:a590\t"

  with cloudflare_record.aaaa_root,
  on dns_records.tf line 10, in resource "cloudflare_record" "aaaa_root":
  10: resource "cloudflare_record" "aaaa_root" {


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":169,"Program":"tfcmt","SHA1":"cf9351f2f185f12d4678631e1ded38a5bb38a96d","Target":"koyashiro.live","Vars":{},"WorkflowName":"terraform"} -->